#pragma once
namespace nsHikageri
{
	namespace nsItem
	{
		namespace nsItemMessagePaperConstant
		{
			static const std::wstring MESSAGEPAPAER_TEXT[ItemMessagePaper::enMessagePaperKind_num] = 
			{
				//enMessagePaperKind_00
				L"もし人がいた時の為、この紙を残しておく。\n"
				L"\n"
				L"俺の名前はダニエル。\n"
				L"気が付くとこんな場所で倒れていた。\n"
				L"\n"
				L"何かヤバそうな雰囲気なんで\n"
				L"逃げた方が良さそうだが\n"
				L"真っ暗で周りがよく見えない。\n"
				L"さっき拾ったこの懐中電灯がなかったら、\n"
				L"気が滅入っちまってたことだろう。\n"
				L"\n"
				L"俺は少し先を見てこようと思う。\n"
				L"薄気味悪い所だが、こいつの電池が切れない\n"
				L"限りは大丈夫だろう。\n"
				L"\n"
				L"誰かこれを読んだら、一緒に出口を探してくれ!\n"
				,

				//enMessagePaperKind_01
				L"一体なんなんだあの化け物は!\n"
				L"こっちを見た途端、雄叫びを上げて\n"
				L"追いかけて来やがった!\n"
				L"\n"
				L"やられちまうかと思ったが、どうやら慌てて\n"
				L"逃げ込んだのがこの部屋で正解だったらしい。\n"
				L"\n"
				L"どうやら奴は強い光が苦手なようだ。\n"
				L"とは言ってもこの懐中電灯の光くらいなら\n"
				L"平気なようだが...\n"
				L"\n"
				L"次また追いかけて来ても、この部屋に逃げ込めば\n"
				L"きっと大丈夫だろう。他にも明るい部屋があれば\n"
				L"覚えておいた方が良さそうだ。\n"
				,

				//enMessagePaperKind_02
				L"機会の部品らしきものを見つけたので、\n"
				L"懐中電灯に合体させてみたのだが、こいつはいい!\n"
				L"\n"
				L"RB2ボタン長押しでチャージしてから\n"
				L"ボタンを離すと、強力なフラッシュが\n"
				L"放てるようになった!\n"
				L"\n"
				L"これならあの化け物にも多少は効果があるだろう。\n"
				L"すぐにでもあいつを目潰ししてやりたい所だが、\n"
				L"どうやらこいつはバッテリーを大きく消耗\n"
				L"してしまうみたいだ。気を付けないとな。\n"
				L"\n"
				L"そういえばこの道の途中に、目のような模様のある\n"
				L"変わった壁があったな。如何にも怪しい感じだし、\n"
				L"もう少し調べてみるとするか。\n"
				,
			};
		}

	}
}